# Birth Names Data

In [31]:
# Import Dependencies
import pandas as pd
import glob
from sqlalchemy import create_engine
import psycopg2
# from secret import username, password

In [2]:
#Import csv files

# Use glob module to include all csv files together
all_files = glob.glob('Resources/*.csv')

# Create and empty list to append to 
li = []

# Write a for loop to import all csv files, include headers
for filename in all_files:
    df = pd.read_csv(filename, index_col=None, header=None, names = ['State','Sex', 'Year','Name', 'Number'])
    li.append(df)
    
# Concatenate all csv files 
names_df = pd.concat(li, axis=0, ignore_index=True)

In [3]:
# Check DataFrame
# names_df=names_df.loc[names_df["year"]>=2000]
names_df

        State Sex  Year      Name  Number
0          AK   F  1910      Mary      14
1          AK   F  1910     Annie      12
2          AK   F  1910      Anna      10
3          AK   F  1910  Margaret       8
4          AK   F  1910     Helen       7
...       ...  ..   ...       ...     ...
6028146    WY   M  2018    Peyton       5
6028147    WY   M  2018   Richard       5
6028148    WY   M  2018     Titus       5
6028149    WY   M  2018   Tristan       5
6028150    WY   M  2018    Zander       5

[6028151 rows x 5 columns]

In [17]:
names_df=names_df.loc[(names_df["Year"]>=1960) & (names_df["Number"]>1000 )]
names_df

        State Sex  Year      Name  Number
462415     CA   F  1980  Jennifer    5611
462416     CA   F  1980   Melissa    2984
462417     CA   F  1980   Jessica    2928
462418     CA   F  1980     Sarah    2578
462419     CA   F  1980  Michelle    2432
...       ...  ..   ...       ...     ...
5898660    WI   M  1983   Michael    1337
5899111    WI   M  1984   Michael    1383
5899112    WI   M  1984   Matthew    1252
5899581    WI   M  1985   Michael    1265
5900065    WI   M  1986   Michael    1207

[7104 rows x 5 columns]

In [18]:
# Check info of DataFrame
names_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7104 entries, 462415 to 5900065
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   State   7104 non-null   object
 1   Sex     7104 non-null   object
 2   Year    7104 non-null   int64
 3   Name    7104 non-null   object
 4   Number  7104 non-null   int64
dtypes: int64(2), object(3)
memory usage: 333.0+ KB

In [19]:
names_df.to_csv('Resources/ALL_STATES.csv')

In [33]:
# Create database connection
connection_string = f'postgres:Koudede$89@localhost:5432/babynames_db'
engine = create_engine(f'postgresql+psycopg2://{connection_string}')

In [34]:
engine.table_names()

['baby_names']

In [38]:
names_df.to_sql(name='baby_names', con=engine, if_exists='append', index=False)

In [41]:
pd.read_sql_query('select* from baby_names limit(10)', con=engine).head()

  State Sex  Year      Name  Number
0    CA   F  1980  Jennifer    5611
1    CA   F  1980   Melissa    2984
2    CA   F  1980   Jessica    2928
3    CA   F  1980     Sarah    2578
4    CA   F  1980  Michelle    2432